Script started on Sun 08 Feb 2015 09:37:18 PM PST
You are currently using 6% (59.7 MiB) of your 1.0 GiB quota.
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/list2...done.
(gdb) b main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) r goo[K[K[Kfoo bar
Starting program: /afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde18) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (char **) 0x7fffffffde18
(gdb) p argv[0]
$3 = 0x7fffffffe0e1 "/afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/list2"
(gdb) p argv[1]
$4 = 0x7fffffffe121 "foo"
(gdb) p argv[2]
$5 = 0x7fffffffe125 "bar"
(gdb) p argv[3]
$6 = 0x0
(gdb) p argv[4]
$7 = 0x7fffffffe129 "LANG=en_US.UTF-8"
(gdb) p argv[5]
$8 = 0x7fffffffe13a "USER=akpinarb"
(gdb) p argv[6]
$9 = 0x7fffffffe148 "LOGNAME=akpinarb"
(gdb) q
A debugging session is active.

	Inferior 1 [process 23912] will be killed.

Quit anyway? (y or n) y
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ exit
exit

Script done on Sun 08 Feb 2015 09:38:07 PM PST
