Script started on Sun 08 Feb 2015 09:33:35 PM PST
You are currently using 6% (59.7 MiB) of your 1.0 GiB quota.
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ mk list2.c
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ tee list2.c.log
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
CSOURCE=uninit.c EXECBIN=uninit
+ cid + uninit.c
+ checksource uninit.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 uninit.c -o uninit -lm
+ tee uninit.c.log
uninit.c: In function â€˜mainâ€™:
uninit.c:6:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
uninit.c:6:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
uninit.c:8:11: warning: â€˜pointerâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("pointer=%p\n", pointer);
           ^
uninit.c:11:11: warning: â€˜fooâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("foo=%d\n", foo);
           ^
+ set +x
============================================================
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ list2
0x1ce6090->node {word=0x7fff5fca833d->[LOGNAME=akpinarb], link=0x1ce6070}
0x1ce6070->node {word=0x7fff5fca832f->[USER=akpinarb], link=0x1ce6050}
0x1ce6050->node {word=0x7fff5fca831e->[LANG=en_US.UTF-8], link=0x1ce6030}
0x1ce6030->node {word=(nil)->[(null)], link=0x1ce6010}
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ valgrind list2 foo bar
==21350== Memcheck, a memory error detector
==21350== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==21350== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==21350== Command: list2 foo bar
==21350== 
0x4c2b180->node {word=0xfff000269->[LANG=en_US.UTF-8], link=0x4c2b130}
0x4c2b130->node {word=(nil)->[(null)], link=0x4c2b0e0}
0x4c2b0e0->node {word=0xfff000265->[bar], link=0x4c2b090}
0x4c2b090->node {word=0xfff000261->[foo], link=0x4c2b040}
==21350== Conditional jump or move depends on uninitialised value(s)
==21350==    at 0x400682: main (list2.c:22)
==21350== 
==21350== 
==21350== HEAP SUMMARY:
==21350==     in use at exit: 80 bytes in 5 blocks
==21350==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==21350== 
==21350== LEAK SUMMARY:
==21350==    definitely lost: 16 bytes in 1 blocks
==21350==    indirectly lost: 64 bytes in 4 blocks
==21350==      possibly lost: 0 bytes in 0 blocks
==21350==    still reachable: 0 bytes in 0 blocks
==21350==         suppressed: 0 bytes in 0 blocks
==21350== Rerun with --leak-check=full to see details of leaked memory
==21350== 
==21350== For counts of detected and suppressed errors, rerun with: -v
==21350== Use --track-origins=yes to see where uninitialised values come from
==21350== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/list2...done.
(gdb) b 26
Breakpoint 1 at 0x400684: file list2.c, line 26.
(gdb) r foo bar
Starting program: /afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe129->[LANG=en_US.UTF-8], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe125->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe121->[foo], link=0x601010}

Breakpoint 1, main (argc=3, argv=0x7fffffffde18) at list2.c:26
26	   return 9;
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) where
#0  main (argc=3, argv=0x7fffffffde18) at list2.c:26
(gdb) list
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) p head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffde18) at list2.c:26
(gdb) p head
$2 = (node *) 0x601090
(gdb) p *head
$3 = {word = 0x7fffffffe129 "LANG=en_US.UTF-8", link = 0x601070}
(gdb) p *(head->word)
$4 = 76 'L'
(gdb) p head->link->link->link
$5 = (node *) 0x601030
(gdb) p *(head->link->link->link)
$6 = {word = 0x7fffffffe121 "foo", link = 0x601010}
(gdb) q
A debugging session is active.

	Inferior 1 [process 21385] will be killed.

Quit anyway? (y or n) y
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ exit
exit

Script done on Sun 08 Feb 2015 09:35:10 PM PST
