Script started on Sun 08 Feb 2015 09:01:48 PM PST
You are currently using 6% (59.7 MiB) of your 1.0 GiB quota.
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ valgrind malloc
==28803== Memcheck, a memory error detector
==28803== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==28803== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==28803== Command: malloc
==28803== 
0x4c2b090-> {6, (nil)}
==28803== 
==28803== HEAP SUMMARY:
==28803==     in use at exit: 16 bytes in 1 blocks
==28803==   total heap usage: 2 allocs, 1 frees, 32 bytes allocated
==28803== 
==28803== LEAK SUMMARY:
==28803==    definitely lost: 16 bytes in 1 blocks
==28803==    indirectly lost: 0 bytes in 0 blocks
==28803==      possibly lost: 0 bytes in 0 blocks
==28803==    still reachable: 0 bytes in 0 blocks
==28803==         suppressed: 0 bytes in 0 blocks
==28803== Rerun with --leak-check=full to see details of leaked memory
==28803== 
==28803== For counts of detected and suppressed errors, rerun with: -v
==28803== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 6 from 6)
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ gdb l[Kmalloc
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/malloc...done.
(gdb) b main
Breakpoint 1 at 0x4005bf: file malloc.c, line 13.
(gdb) r
Starting program: /afs/cats.ucsc.edu/users/t/akpinarb/private/cmps012m/lab5/malloc 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=1, argv=0x7fffffffdd98) at malloc.c:13
13	   node *ptr = malloc (sizeof (struct node));
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.149.el6_6.5.x86_64
(gdb) p ptr
$1 = (node *) 0x0
(gdb) p *ptr
Cannot access memory at address 0x0
(gdb) n
14	   ptr = malloc (sizeof (node));
(gdb) n
15	   ptr->value = 6;
(gdb) n
16	   ptr->link = NULL;
(gdb) print ptr
$2 = (node *) 0x601030
(gdb) print *pte[Kr
$3 = {value = 6, link = 0x0}
(gdb) n
17	   printf ("%p-> {%d, %p}\n", ptr, ptr->value, ptr->link);
(gdb) n
0x601030-> {6, (nil)}
18	   free (ptr);
(gdb) n
19	   return EXIT_SUCCESS;
(gdb) n
20	}
(gdb) q
A debugging session is active.

	Inferior 1 [process 29077] will be killed.

Quit anyway? (y or n) y
]0;akpinarb@unix2:lab5[akpinarb@unix2 lab5]$ exit
exit

Script done on Sun 08 Feb 2015 09:03:20 PM PST
